In [1]:
!pip install sqlalchemy pymysql cryptography

Collecting sqlalchemy
  Using cached sqlalchemy-2.0.41-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Collecting cryptography
  Downloading cryptography-45.0.2-cp311-abi3-win_amd64.whl.metadata (5.7 kB)
Collecting greenlet>=1 (from sqlalchemy)
  Using cached greenlet-3.2.2-cp312-cp312-win_amd64.whl.metadata (4.2 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\andre\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.13.2)
Requirement already satisfied: cffi>=1.14 in c:\users\andre\appdata\local\programs\python\python312\lib\site-packages (from cryptography) (1.17.1)
Requirement already satisfied: pycparser in c:\users\andre\appdata\local\programs\python\python312\lib\site-packages (from cffi>=1.14->cryptography) (2.22)
Using cached sqlalchemy-2.0.41-cp312-cp312-win_amd64.whl (2.1 MB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Downloading cryptography-45.0.2-cp311-abi3-win_amd64.whl (3.4 MB)
   ---------------------------------------- 0.0/3.4 MB ? eta -:--:--
   ---------------------------------------- 3.4/3.4 MB 25.2 MB/s eta 0:00:00
Using cached greenlet-3.2.2-cp312-cp312-win_amd64.whl (296 kB)
Installing collected packages: pymysql, greenlet, sqlalchemy, cryptography
Successfully installed cryptography-45.0.2 greenlet-3.2.2 pymysql-1.1.1 sqlalchemy-2.0.41

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text

In [5]:
connection_string = 'mysql+pymysql://root:BwCIs7mc@localhost:3306/sakila'

In [6]:
# Crear motor de conexión
engine = create_engine(connection_string)

In [ ]:
#FUNCION RENTALS_MONTH

def rentals_month(engine, month, year):
    query = text(f"""
        SELECT * 
        FROM rental 
        WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}
    """)  # ✅ Aquí está la clave: text(...)
    
    with engine.connect() as connection:
        result = connection.execute(query)
        df = pd.DataFrame(result.fetchall(), columns=result.keys())
    return df

In [10]:
df_may = rentals_month(engine, 5, 2005)
df_june = rentals_month(engine, 6, 2005)
df_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [11]:
df_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [12]:
#FUNCION RENTAL_COUNT_MONTH

def rental_count_month(rentals_df, month, year):
    rental_counts = rentals_df.groupby('customer_id').size().reset_index(name=f"rentals_{str(month).zfill(2)}_{year}")
    return rental_counts

In [13]:
count_may = rental_count_month(df_may, 5, 2005)
count_june = rental_count_month(df_june, 6, 2005)

In [14]:
count_may

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [15]:
count_june

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [16]:
# FUNCIÓN COMPARE_RENTALS

def compare_rentals(count1, count2):
    merged = pd.merge(count1, count2, on='customer_id', how='outer').fillna(0)
    col1, col2 = merged.columns[1], merged.columns[2]
    merged['difference'] = merged[col2] - merged[col1]
    return merged

In [17]:
comparison = compare_rentals(count_may, count_june)
comparison.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1              2.0              7.0         5.0
1            2              1.0              1.0         0.0
2            3              2.0              4.0         2.0
3            4              0.0              6.0         6.0
4            5              3.0              5.0         2.0